Masmiseim36/nxpSDK/middleware/se_hostlib/demos/ksdk/common/boards/lpcxpresso55s69/se_hostlib_examples/cloud_demo/pin_mux.c
    const uint32_t port1_pin21_config = (/* Pin is configured as FC4_RXD_SDA_MOSI_DATA */
                                         IOCON_PIO_FUNC5 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN21 (coords: 30) is configured as FC4_RXD_SDA_MOSI_DATA */
    IOCON_PinMuxSet(IOCON, 1U, 21U, port1_pin21_config);



//RC663 Reset
    const uint32_t port0_pin15_config = (/* Pin is configured as PIO0_15 RESET */
            IOCON_PIO_FUNC0 |
            /* No addition pin function */
            IOCON_PIO_MODE_PULLDOWN |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN15  is configured as PIO0_15 */
    IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);

//RC663 IRQ
   const uint32_t port1_pin10_config = (/* Pin is configured as PIO1_10 IRQ*/
            IOCON_PIO_FUNC0 |
            /* No addition pin function */
            IOCON_PIO_MODE_INACT |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN10 (coords: 64) is configured as PIO1_10 */
    IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);

//RC663 MISO
   const uint32_t port0_pin19_config = (/* Pin is configured as FC7_TXD_SCL_MISO_WS */
            IOCON_PIO_FUNC7 |
            /* Selects pull-up function */
            IOCON_PIO_MODE_PULLUP |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN19 (coords: 90) is configured as FC7_TXD_SCL_MISO_WS */
    IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);

//RC663 MOSI
    const uint32_t port0_pin20_config = (/* Pin is configured as FC7_RXD_SDA_MOSI_DATA */
            IOCON_PIO_FUNC7 |
            /* Selects pull-up function */
            IOCON_PIO_MODE_PULLUP |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN20 (coords: 74) is configured as FC7_RXD_SDA_MOSI_DATA */
    IOCON_PinMuxSet(IOCON, 0U, 20U, port0_pin20_config);

//RC663 SCK
    const uint32_t port0_pin21_config = (/* Pin is configured as FC7_SCK */
            IOCON_PIO_FUNC7 |
            /* Selects pull-up function */
            IOCON_PIO_MODE_PULLUP |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN21 (coords: 76) is configured as FC7_SCK */
    IOCON_PinMuxSet(IOCON, 0U, 21U, port0_pin21_config);

//RC663 CSEL
    const uint32_t port1_pin11_config = (/* Pin is configured as port PIO1_11*/
            IOCON_PIO_FUNC0 |
            /* Selects pull-up function */
            IOCON_PIO_MODE_PULLUP |
            /* Standard mode, output slew rate control is enabled */
            IOCON_PIO_SLEW_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN11 is configured as PIO1_11 */
    IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);



    // const uint32_t port1_pin18_config = (/* Pin is configured as PIO1_18 Interrupt to go into card write mode*/
    //         IOCON_PIO_FUNC0 |
    //         /* No addition pin function */
    //         IOCON_PIO_MODE_INACT |
    //         /* Standard mode, output slew rate control is enabled */
    //         IOCON_PIO_SLEW_STANDARD |
    //         /* Input function is not inverted */
    //         IOCON_PIO_INV_DI |
    //         /* Enables digital function */
    //         IOCON_PIO_DIGITAL_EN |
    //         /* Open drain is disabled */
    //         IOCON_PIO_OPENDRAIN_DI);
    // /* PORT1 PIN10 (coords: 64) is configured as PIO1_18 */
    // IOCON_PinMuxSet(IOCON, 1U, 18U, port1_pin18_config);

//enable SE050
    IOCON->PIO[1][5] = ((IOCON->PIO[1][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK)))

                        /* Selects pin function.
                         * : PORT15 (pin 31) is configured as PIO1_5. */
                        | IOCON_PIO_FUNC(PIO1_5_FUNC_ALT0));
}

